er.dbml
Table users {
  id bigint [pk]
  email varchar [unique]
  username varchar
  password_digest varchar
  google_uid varchar [unique]
  guest boolean
  created_at datetime
  updated_at datetime
}

Table sessions {
  id bigint [pk]
  user_id bigint [not null, ref: > users.id]
  ip_address varchar
  user_agent varchar
  created_at datetime
  updated_at datetime
}

Table diaries {
  id bigint [pk]
  user_id bigint [not null, ref: > users.id]
  diary_date date
  body text
  published boolean
  created_at datetime
  updated_at datetime
}
